# IndexStream Properties

---
The IndexStream type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IndexStream Class
Autodesk.Revit.DB.DirectContext3D Namespace